STMicroelectronics/STM32CubeWB/Projects/NUCLEO-WB15CC/Examples/CRYP/CRYP_DMA/CRYP_DMA.ioc
#MicroXplorer Configuration settings - do not modify
AES2.Algorithm=CRYP_AES_ECB
AES2.DataType=CRYP_DATATYPE_32B
AES2.DataWidthUnit=CRYP_DATAWIDTHUNIT_WORD
AES2.IPParameters=Algorithm,DataType,KeySize,pKey,DataWidthUnit,KeyIVConfigSkip
AES2.KeyIVConfigSkip=CRYP_KEYIVCONFIG_ALWAYS
AES2.KeySize=CRYP_KEYSIZE_128B
AES2.pKey=2B7E1516 28AED2A6 ABF71588 09CF4F3C
CAD.formats=
CAD.pinconfig=
CAD.provider=
Dma.AES2_IN.0.Direction=DMA_MEMORY_TO_PERIPH
Dma.AES2_IN.0.EventEnable=DISABLE
Dma.AES2_IN.0.Instance=DMA1_Channel1
Dma.AES2_IN.0.MemDataAlignment=DMA_MDATAALIGN_WORD
Dma.AES2_IN.0.MemInc=DMA_MINC_ENABLE
Dma.AES2_IN.0.Mode=DMA_NORMAL
Dma.AES2_IN.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Dma.AES2_IN.0.PeriphInc=DMA_PINC_DISABLE
Dma.AES2_IN.0.Polarity=HAL_DMAMUX_REQUEST_GEN_RISING
Dma.AES2_IN.0.Priority=DMA_PRIORITY_LOW
Dma.AES2_IN.0.RequestNumber=1
Dma.AES2_IN.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.AES2_IN.0.SignalID=NONE
Dma.AES2_IN.0.SyncEnable=DISABLE
Dma.AES2_IN.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.AES2_IN.0.SyncRequestNumber=1
Dma.AES2_IN.0.SyncSignalID=NONE
Dma.AES2_OUT.1.Direction=DMA_PERIPH_TO_MEMORY
Dma.AES2_OUT.1.EventEnable=DISABLE
Dma.AES2_OUT.1.Instance=DMA1_Channel2
Dma.AES2_OUT.1.MemDataAlignment=DMA_MDATAALIGN_WORD
Dma.AES2_OUT.1.MemInc=DMA_MINC_ENABLE
Dma.AES2_OUT.1.Mode=DMA_NORMAL
Dma.AES2_OUT.1.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Dma.AES2_OUT.1.PeriphInc=DMA_PINC_DISABLE
Dma.AES2_OUT.1.Polarity=HAL_DMAMUX_REQUEST_GEN_RISING
Dma.AES2_OUT.1.Priority=DMA_PRIORITY_LOW
Dma.AES2_OUT.1.RequestNumber=1
Dma.AES2_OUT.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.AES2_OUT.1.SignalID=NONE
Dma.AES2_OUT.1.SyncEnable=DISABLE
Dma.AES2_OUT.1.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.AES2_OUT.1.SyncRequestNumber=1
Dma.AES2_OUT.1.SyncSignalID=NONE
Dma.Request0=AES2_IN
Dma.Request1=AES2_OUT
Dma.RequestsNb=2
File.Version=6
GPIO.groupedBy=
KeepUserPlacement=true
Mcu.CPN=STM32WB15CCU6
Mcu.Family=STM32WB
Mcu.IP0=AES2
Mcu.IP1=DMA
Mcu.IP2=NVIC
Mcu.IP3=RCC
Mcu.IP4=SYS
Mcu.IPNb=5
Mcu.Name=STM32WB15CCUx
Mcu.Package=UFQFPN48
Mcu.Pin0=VP_AES2_VS_AES
Mcu.Pin1=VP_SYS_VS_Systick
Mcu.PinsNb=2
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32WB15CCUx
MxCube.Version=6.8.0
MxDb.Version=DB.6.0.80
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DMA1_Channel1_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:true
NVIC.DMA1_Channel2_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PCC.Ble.ConnectionInterval=1000.0
PCC.Ble.DataLength=6
PCC.Ble.IsUsed=false
PCC.Ble.Mode=NOT_SELECTED
PCC.Ble.PowerLevel=Min
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32WB15CCUx
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=2
ProjectManager.MainLocation=Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=CRYP_DMA.ioc
ProjectManager.ProjectName=CRYP_DMA
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=EWARM V8
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-MX_DMA_Init-DMA-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-true,3-MX_AES2_Init-AES2-false-HAL-true
RCC.AHB2CLKDivider=RCC_SYSCLK_DIV2
RCC.AHBFreq_Value=64000000
RCC.APB1Freq_Value=64000000
RCC.APB1TimFreq_Value=64000000
RCC.APB2Freq_Value=64000000
RCC.APB2TimFreq_Value=64000000
RCC.APB3Freq_Value=16000000
RCC.Cortex2Freq_Value=32000000
RCC.CortexFreq_Value=64000000
RCC.FCLK2Freq_Value=32000000
RCC.FCLKCortexFreq_Value=64000000
RCC.FamilyName=M
RCC.HCLK2Freq_Value=32000000
RCC.HCLK3Freq_Value=64000000
RCC.HCLKFreq_Value=64000000
RCC.HCLKRFFreq_Value=16000000
RCC.HSE_VALUE=8000000
RCC.HSI_VALUE=16000000
RCC.I2C1Freq_Value=64000000
RCC.IPParameters=AHB2CLKDivider,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,APB3Freq_Value,Cortex2Freq_Value,CortexFreq_Value,FCLK2Freq_Value,FCLKCortexFreq_Value,FamilyName,HCLK2Freq_Value,HCLK3Freq_Value,HCLKFreq_Value,HCLKRFFreq_Value,HSE_VALUE,HSI_VALUE,I2C1Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,RFWKPFreq_Value,RNGFreq_Value,SMPS1Freq_Value,SMPSFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USART1Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
RCC.LPTIM1Freq_Value=64000000
RCC.LPTIM2Freq_Value=64000000
RCC.LPUART1Freq_Value=64000000
RCC.LSCOPinFreq_Value=32000
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.MCO1PinFreq_Value=64000000
RCC.PLLN=32
RCC.PLLPoutputFreq_Value=64000000
RCC.PLLQoutputFreq_Value=64000000
RCC.PLLRCLKFreq_Value=64000000
RCC.PWRFreq_Value=64000000
RCC.RFWKPFreq_Value=32000
RCC.RNGFreq_Value=32000
RCC.SMPS1Freq_Value=8000000
RCC.SMPSFreq_Value=4000000
RCC.SYSCLKFreq_VALUE=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.USART1Freq_Value=64000000
RCC.VCOInputFreq_Value=4000000
RCC.VCOOutputFreq_Value=128000000
VP_AES2_VS_AES.Mode=AES_Activate
VP_AES2_VS_AES.Signal=AES2_VS_AES
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=custom
ProjectManager.Example=CRYP_DMA
ProjectManager.ExampleSource=CubeFw
